
# MySQL Data Types 

Focus areas:
- Numeric data types 
- String data types 
- Date & Time data types 
- Boolean values and NULL handling
- Valid and invalid data scenarios


## Database Setup

A dedicated database is created to isolate all examples used in this notebook.

In [ ]:

CREATE DATABASE mysql_datatypes_demo;

In [ ]:
USE mysql_datatypes_demo;


## Numeric Data Types

Numeric data types are used to store numbers. MySQL supports both **exact** and
**approximate** numeric types.

- INT: Whole numbers
- DECIMAL(p,s): Exact precision numbers (commonly used for money)
- FLOAT / DOUBLE: Approximate values

In [ ]:

CREATE TABLE numeric_types (
    id INT PRIMARY KEY,
    stock INT,
    price DECIMAL(10,2),
    discount_rate FLOAT,
    tax_rate DOUBLE
);


### Insert Valid Numeric Values

This query inserts valid whole numbers, fixed-precision decimals, and floating-point values.

In [ ]:

INSERT INTO numeric_types VALUES
(1, 50, 1999.99, 0.10, 0.18),
(2, 20, 499.50, 0.05, 0.12);


### Arithmetic Operations on Numeric Columns

Demonstrates addition, subtraction, multiplication, and division using numeric columns.

In [ ]:

SELECT 
    id,
    price + (price * tax_rate) AS price_with_tax,
    price - (price * discount_rate) AS discounted_price,
    price * stock AS inventory_value,
    price / NULLIF(stock, 0) AS unit_price
FROM numeric_types;


### Invalid Numeric Insert

Attempts to insert non-numeric data into numeric columns.

In [ ]:

-- Invalid: string value for INT
INSERT INTO numeric_types VALUES (3, 'ABC', 100.00, 0.2, 0.1);


## String Data Types

String data types are used to store text data. MySQL provides different string types
depending on length, storage, and use case.

- CHAR(n): Fixed-length strings
- VARCHAR(n): Variable-length strings
- TEXT: Large unstructured text

In [ ]:

CREATE TABLE string_types (
    id INT PRIMARY KEY,
    country_code CHAR(2),
    customer_name VARCHAR(50),
    email VARCHAR(100),
    comments TEXT
);


### Insert Valid String Values

Demonstrates fixed-length CHAR and variable-length VARCHAR storage.

In [ ]:

INSERT INTO string_types VALUES
(1, 'IN', 'Arjun Sharma', 'arjun@example.com', 'Premium customer'),
(2, 'US', 'Priya Nair', 'priya@example.com', 'New signup');


### String Concatenation

Combines multiple string columns into a single readable output.

In [ ]:

SELECT 
    CONCAT(customer_name, ' <', email, '>') AS contact_info
FROM string_types;


### String Case Functions

Demonstrates conversion to upper and lower case.

In [ ]:

SELECT 
    UPPER(customer_name) AS upper_name,
    LOWER(customer_name) AS lower_name
FROM string_types;


### String Length and Substring Functions

Shows how to measure string length and extract parts of strings.

In [ ]:

SELECT 
    customer_name,
    LENGTH(customer_name) AS name_length,
    SUBSTRING(customer_name, 1, 5) AS short_name
FROM string_types;


### Pattern Matching with LIKE

Filters records using wildcard-based pattern matching.

In [ ]:

SELECT *
FROM string_types
WHERE customer_name LIKE 'A%';


### Invalid String Length Scenario

Attempts to insert a value exceeding the defined length.

In [ ]:

-- Error - Data too long for column 'customer_name' at row 1
INSERT INTO string_types VALUES
(3, 'IND', 'VeryLongCustomerNameExceedingLimit', 'test@example.com', 'Invalid example');


## Date & Time Data Types

MySQL provides dedicated types for storing and manipulating dates and times.

- DATE: Stores calendar dates
- TIME: Stores time of day
- DATETIME: Stores date and time

In [ ]:

CREATE TABLE datetime_types (
    id INT PRIMARY KEY,
    order_date DATE,
    order_time TIME,
    created_at DATETIME
);


### Insert Valid Date and Time Values

Demonstrates ISO date format and MySQL date functions.

In [ ]:

INSERT INTO datetime_types VALUES
(1, '2025-01-10', '10:30:00', '2025-01-10 10:30:00'),
(2, STR_TO_DATE('2025-01-11','%Y-%m-%d'), '14:15:00', NOW());


### Extracting Parts from DATE and DATETIME

Shows how to extract year, month, and day values.

In [ ]:

SELECT
    id,
    YEAR(order_date) AS order_year,
    MONTH(order_date) AS order_month,
    DAY(order_date) AS order_day
FROM datetime_types;


### Date Arithmetic

Adds and subtracts days using INTERVAL.

In [ ]:

SELECT
    order_date,
    DATE_ADD(order_date, INTERVAL 7 DAY) AS plus_7_days,
    DATE_SUB(order_date, INTERVAL 1 MONTH) AS minus_1_month
FROM datetime_types;


### Date Comparison

Filters rows based on date ranges.

In [ ]:

SELECT *
FROM datetime_types
WHERE order_date BETWEEN '2025-01-01' AND '2025-01-31';


### Invalid Date Scenario

Attempts to insert an invalid date value.

In [ ]:

-- Invalid date
INSERT INTO datetime_types VALUES (3, '2025-15-40', '12:00:00', NOW());


## Boolean and NULL Handling

MySQL represents BOOLEAN as TINYINT(1).
NULL represents missing or unknown values.

In [ ]:

CREATE TABLE boolean_null_types (
    id INT PRIMARY KEY,
    is_active BOOLEAN,
    remarks VARCHAR(50)
);


### Insert Boolean and NULL Values

In [ ]:

INSERT INTO boolean_null_types VALUES
(1, TRUE, 'Active'),
(2, FALSE, NULL),
(3, 1, 'Enabled'),
(4, 0, 'Disabled');


### NULL Comparisons

Demonstrates correct and incorrect ways to check NULL values.

In [ ]:

-- Correct NULL check
SELECT * FROM boolean_null_types WHERE remarks IS NULL;

-- Incorrect NULL check (returns no rows)
SELECT * FROM boolean_null_types WHERE remarks = NULL;


## Summary

This notebook provided a deep, practical exploration of MySQL data types:

- Numeric types for exact and approximate calculations
- String types for fixed, variable, and large text storage
- Date and time types with extraction, arithmetic, and comparison
- Boolean representation and NULL handling
- Clear valid and invalid scenarios

A strong understanding of data types is essential for schema design,
data integrity, and reliable query behavior in MySQL.


### Cleanup

In [ ]:

DROP DATABASE mysql_datatypes_demo;